Revit 2027 API
Transform.BasisX Property
The basis of the X axis of this transformation.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ BasisX { get; set; }
Public Property BasisX As XYZ
	Get
	Set
public:
property XYZ^ BasisX {
	XYZ^ get ();
	void set (XYZ^ value);
}
member BasisX : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
InvalidOperationException |  Thrown when the transform is internally marked as read-only.
Remarks
 The X axis of the old coordinate system in the new coordinate system, or the 1st column of the conventional 3x4 matrix representation.
See Also
Reference
Transform Class
Autodesk.Revit.DB Namespace